import pandas as pd


gold_values = [
    ["20220101", 1800.0],
    ["20220201", 1907.3],
    ["20220301", 1943.1],
    ["20220401", 1896.9],
    ["20220501", 1839.0],
    ["20220601", 1801.5],
    ["20220701", 1778.0],
    ["20220801", 1715.2],
    ["20220901", 1668.3],
    ["20221001", 1640.4],
    ["20221101", 1793.4],
    ["20221201", 1830.1],
    ["20230101", 1941.4],
]
gold_columns = ["<DATE>", "<CLOSE>"]
gold = pd.DataFrame(gold_values, columns=gold_columns)
gold.rename(columns={"<DATE>": "дата", "<CLOSE>": "цена_закрытия"}, inplace=True)
print(gold)
