import pandas as pd


trading_time_values = [
    ["Токийская фондовая биржа", "TSE", "03:00-09:00"],
    ["Лондонская международная биржа финансовых фьючерсов", "LIFFE", "04:00-00:00"],
    ["Гонконгская фондовая биржа", "HKSE", "04:00-10:00"],
    ["Шанхайская фондовая биржа", "SSE", "04:30-10:00"],
    ["Шэнчьжэньская фондовая биржа", "SZSE", "04:30-10:00"],
    ["Европейская биржа деривативов", "EUREX", "09:00-01:00"],
    ["Московская биржа", "MOEX", "10:00-18:50"],
    ["Консорциум европейских бирж", "EURONEXT", "10:00-18:30"],
    ["Лондонская фондовая биржа", "LSE", "11:00-19:30"],
    ["Нью-Йоркская товарная биржа", "NYMEX", "17:00-23:30"],
    ["Фондовая биржа Торонто", "TSX", "17:30-00:00"],
    ["Электронная система торговли ценными бумагами", "NASDAQ", "16:30-23:00"],
    ["Нью-Йоркская фондовая биржа", "NYSE", "16:30-23:00"],
    ["Чикагская товарная биржа", "CME", "18:00-02:00"],
]
trading_time_columns = ["Биржа", "Сокращенное наименование", "Время работы биржи (мск)"]
trading_time = pd.DataFrame(trading_time_values, columns=trading_time_columns)
print(trading_time.columns)
