import pandas as pd


unemployment_values = [
    ["январь", 5.6, 5.2, 4.9, 4.7, 5.8, 4.4],
    ["февраль", 5.6, 5.0, 4.9, 4.6, 5.7, 4.1],
    ["март", 5.4, 5.0, 4.7, 4.7, 5.4, 4.1],
    ["апрель", 5.3, 4.9, 4.7, 5.8, 5.2, 4.0],
    ["май", 5.2, 4.7, 4.5, 6.1, 4.9, 3.9],
    ["июнь", 5.1, 4.7, 4.4, 6.2, 4.8, 3.9],
    ["июль", 5.1, 4.7, 4.5, 6.3, 4.5, 3.9],
    ["август", 4.9, 4.6, 4.3, 6.4, 4.4, 3.8],
    ["сентябрь", 5.0, 4.5, 4.5, 6.3, 4.3, 3.9],
    ["октябрь", 5.0, 4.7, 4.6, 6.3, 4.3, 3.9],
    ["ноябрь", 5.1, 4.8, 4.6, 6.1, 4.3, 3.7],
    ["декабрь", 5.1, 4.8, 4.6, 5.9, 4.3, 3.7],
]
unemployment_columns = ["месяц", "2017", "2018", "2019", "2020", "2021", "2022"]
unemployment = pd.DataFrame(unemployment_values, columns=unemployment_columns)
unemployment.set_index("месяц", inplace=True)
unemployment.reset_index(inplace=True)
print(unemployment.tail(3))
