import pandas as pd


unemployment_values = [
    ["январь", 4.9, 4.7, 5.8, 4.4],
    ["февраль", 4.9, 4.6, 5.7, 4.1],
    ["март", 4.7, 4.7, 5.4, 4.1],
    ["апрель", 4.7, 5.8, 5.2, 4.0],
    ["май", 4.5, 6.1, 4.9, 3.9],
    ["июнь", 4.4, 6.2, 4.8, 3.9],
    ["июль", 4.5, 6.3, 4.5, 3.9],
    ["август", 4.3, 6.4, 4.4, 3.8],
    ["сентябрь", 4.5, 6.3, 4.3, 3.9],
    ["октябрь", 4.6, 6.3, 4.3, 3.9],
    ["ноябрь", 4.6, 6.1, 4.3, 3.7],
    ["декабрь", 4.6, 5.9, 4.3, 3.7],
]
unemployment_columns = ["месяц", "2019", "2020", "2021", "2022"]
unemployment = pd.DataFrame(unemployment_values, columns=unemployment_columns)
u_2018 = [5.2, 5, 5, 4.9, 4.7, 4.7, 4.7, 4.6, 4.5, 4.7, 4.8, 4.8]
unemployment.insert(1, column="2018", value=u_2018)
print(unemployment)
