import pandas as pd


interest_rates_values = [
    ["Австралия", "Резервный банк Австралии", 4.1, "2023-06-06"],
    ["Бразилия", "Центральный банк Бразилии", 13.75, "2022-08-04"],
    ["Великобритания", "Банк Англии", 5.0, "2023-06-22"],
    ["Дания", "Национальный банк Дании", 3.25, "2023-06-15"],
    ["Еврозона", "Европейский центральный банк", 4.0, "2023-06-15"],
    ["Индия", "Резервный банк Индии", 6.5, "2023-02-08"],
    ["Канада", "Банк Канады", 5.0, "2023-07-12"],
    ["Китай", "Народный банк Китая", 3.55, "2023-06-20"],
    ["Мексика", "Банк Мексики", 11.25, "2023-03-30"],
    ["Новая Зеландия", "Резервный банк Новой Зеландии", 5.5, "2023-05-24"],
    ["Россия", "Центральный банк Российской Федерации", 8.5, "2023-07-24"],
    ["США", "Федеральная резервная система", 5.25, "2023-05-04"],
    ["Турция", "Центральный банк Турции", 17.5, "2023-07-20"],
    ["Швейцария", "Национальный банк Швейцарии", 1.75, "2023-06-22"],
    ["Швеция", "Банк Швеции", 3.75, "2023-06-30"],
    ["ЮАР", "Южно-Африканский резервный банк", 8.25, "2023-05-25"],
    ["Япония", "Банк Японии", -0.1, "2016-08-03"],
]
interest_rates_columns = ["Страна", "Банк", "Ставка", "Дата вступления в силу"]
interest_rates = pd.DataFrame(interest_rates_values, columns=interest_rates_columns)
interest_rates.set_index("Страна", inplace=True)
interest_rates.info()
