import pandas as pd


df_values = [
    ["AMEZ", 'ПАО "Ашинский метзавод"', "ао", 51480414016, "металлургия"],
    ["BSPB", 'ПАО "Банк "Санкт-Петербург"', "ао", 134333130048, "банк"],
    ["BSPBP", 'ПАО "Банк "Санкт-Петербург"', "ап", 1234140000, "банк"],
    ["CHMF", 'ПАО "Северсталь"', "ао", 1147004389272, "металлургия"],
    ["CHMK", 'ПАО "ЧМК"', "ао", 35398198175, "металлургия"],
    ["GMKN", 'ПАО "ГМК "Норильский никель"', "ао", 2474552670636, "металлургия"],
    ["MAGN", 'ПАО "ММК"', "ао", 583970485800, "металлургия"],
    ["MTLR", 'ПАО "Мечел"', "ао", 85098228400, "металлургия"],
    ["MTLRP", 'ПАО "Мечел"', "ап", 31456192630, "металлургия"],
    ["NLMK", 'ПАО "НЛМК"', "ао", 1255940700414, "металлургия"],
    ["ROSB", "ПАО РОСБАНК", "ао", 158242989006, "банк"],
    ["RUAL", 'МКПАО "ОК РУСАЛ"', "ао", 626180107537, "металлургия"],
    ["SBER", "ПАО Сбербанк", "ао", 5628796691000, "банк"],
    ["SBERP", "ПАО Сбербанк", "ап", 260380000000, "банк"],
    ["TRMK", 'ПАО "ТМК"', "ао", 229500690203, "металлургия"],
    ["USBN", 'ПАО "БАНК УРАЛСИБ"', "ао", 71090589258, "банк"],
    ["VTBR", "Банк ВТБ (ПАО)", "ао", 693929707327, "банк"],
]
df_columns = ["Торговый код", "Эмитент", "Тип", "Капитализация, руб.", "Отрасль"]
df = pd.DataFrame(df_values, columns=df_columns)
df.set_index("Торговый код", inplace=True)
print(df.filter(regex="^R", axis=0))
