import pandas as pd


pmi_usa_values = [
    ["Декабрь 2023", 51.3, 50.7],
    ["Ноябрь 2023", 50.8, 50.4],
    ["Октябрь 2023", 50.6, 50.9],
    ["Сентябрь 2023", 50.1, 50.2],
    ["Август 2023", 50.5, 51.0],
    ["Июль 2023", 52.3, 52.4],
    ["Июнь 2023", 54.4, 54.1],
    ["Май 2023", 54.9, 55.1],
    ["Апрель 2023", 53.6, 53.7],
    ["Март 2023", 52.6, 53.8],
    ["Февраль 2023", 50.6, 50.5],
    ["Январь 2023", 46.8, 46.6],
    ["Декабрь 2022", 44.7, 44.4],
    ["Ноябрь 2022", 46.2, 46.1],
    ["Октябрь 2022", 47.8, 46.6],
    ["Сентябрь 2022", 49.3, 49.2],
    ["Август 2022", 43.7, 44.3],
    ["Июль 2022", 47.3, 47.0],
    ["Июнь 2022", 52.7, 51.6],
    ["Май 2022", 53.4, 53.5],
    ["Апрель 2022", 55.6, 54.7],
    ["Март 2022", 58.0, 58.9],
    ["Февраль 2022", 56.5, 56.7],
    ["Январь 2022", 51.2, 50.9],
]
pmi_usa_columns = ["месяц", "факт", "прогноз"]
df = pd.DataFrame(pmi_usa_values, columns=pmi_usa_columns)
print(df.head(10))
