import pandas as pd


moex_stock_values = [
    ["июль 2023", 3602.5],
    ["июнь 2023", 3072.9],
    ["май 2023", 3212.3],
    ["апрель 2023", 3015.6],
    ["март 2023", 3186.0],
    ["февраль 2023", 2487.9],
    ["январь 2023", 1599.7],
    ["декабрь 2022", 4206.9],
    ["ноябрь 2022", 3169.5],
    ["октябрь 2022", 1953.6],
    ["сентябрь 2022", 2506.4],
    ["август 2022", 1872.1],
    ["июль 2022", 1492.7],
    ["июнь 2022", 1531.1],
    ["май 2022", 995.4],
    ["апрель 2022", 1446.0],
    ["март 2022", 635.3],
    ["февраль 2022", 5648.8],
    ["январь 2022", 5002.6],
]
moex_stock_columns = ["Период", "Объем торгов на фондовом рынке, млрд руб."]
moex_stock = pd.DataFrame(moex_stock_values, columns=moex_stock_columns)
print(moex_stock)
