import pandas as pd
import numpy as np


def convert_datetime(datetime):
    date, day_name = datetime.split()
    day, month, year = date.split(".")
    if month == "01":
        year = str(int(year) - 1)
    return f"{day_name} {year}"


pmi_manufacturing_india_values = [
    ["03.07.2023 (июнь)", 57.8, 58, 58.7],
    ["01.06.2023 (май)", 58.7, 56.5, 57.2],
    ["01.05.2023 (апр)", 57.2, 55.8, 56.4],
    ["03.04.2023 (мар)", 56.4, 55, 55.3],
    ["01.03.2023 (фев)", 55.3, 54.3, 55.4],
    ["01.02.2023 (янв)", 55.4, 57.4, 57.8],
    ["02.01.2023 (дек)", 57.8, 54.3, 55.7],
    ["01.12.2022 (нояб)", 55.7, 55, 55.3],
    ["01.11.2022 (окт)", 55.3, 54.9, 55.1],
    ["03.10.2022 (сент)", 55.1, 55.8, 56.2],
    ["01.09.2022 (авг)", 56.2, 55, 56.4],
    ["01.08.2022 (июль)", 56.4, 53.8, 53.9],
    ["01.07.2022 (июнь)", 53.9, 54.5, 54.6],
    ["01.06.2022 (май)", 54.6, 54.2, 54.7],
    ["02.05.2022 (апр)", 54.7, 53.8, 54.0],
    ["04.04.2022 (мар)", 54.0, 55.2, 54.9],
    ["02.03.2022 (фев)", 54.9, 54.3, 54.0],
    ["01.02.2022 (янв)", 54.0, 54.6, 55.5],
    ["03.01.2022 (дек)", 55.5, np.nan, 57.6],
    ["01.12.2021 (нояб)", 57.6, 55.1, 55.9],
    ["01.11.2021 (окт)", 55.9, 54, 53.7],
    ["01.10.2021 (сент)", 53.7, 51.8, 52.3],
    ["01.09.2021 (авг)", 52.3, 55, 55.3],
    ["02.08.2021 (июль)", 55.3, 50.5, 48.1],
    ["01.07.2021 (июнь)", 48.1, np.nan, 50.8],
    ["01.06.2021 (май)", 50.8, 52, 55.5],
    ["03.05.2021 (апр)", 55.5, 51.6, 55.4],
    ["05.04.2021 (мар)", 55.4, 57.5, 57.5],
    ["01.03.2021 (фев)", 57.5, 57.5, 57.7],
    ["01.02.2021 (янв)", 57.7, 56, 56.4],
]
pmi_manufacturing_india_columns = ["Дата выпуска", "Факт.", "Прогноз", "Пред."]
pmi_manufacturing_india = pd.DataFrame(
    pmi_manufacturing_india_values, columns=pmi_manufacturing_india_columns
)
pmi_manufacturing_india["Дата выпуска"] = pmi_manufacturing_india["Дата выпуска"].apply(
    convert_datetime
)
print(pmi_manufacturing_india)
