import pandas as pd


df_values = [
    ["2017 год (за полугодие, 9 месяцев и год)", 2.786, "31 132 ₽ млн / 521 $ млн"],
    [
        "2018 год (за 1 квартал, полугодие, 9 месяцев и год)",
        5.902,
        "65 951 ₽ млн / 1 007 $ млн",
    ],
    [
        "2019 год (за 1 квартал, полугодие, 9 месяцев и год)",
        5.335,
        "59 615 ₽ млн / 911 $ млн",
    ],
    ["2020 год (за полугодие, 9 месяцев и год)", 3.943, "44 060 ₽ млн / 593 $ млн"],
    [
        "2021 год (за 1 квартал, полугодие и 9 месяцев)",
        7.988,
        "89 261 ₽ млн / 1 223 $ млн",
    ],
]
df_columns = ["Год", "Размер дивиденда на 1 акцию, руб.", "Начислено дивидендов"]
df = pd.DataFrame(df_values, columns=df_columns)
df["Год"] = df["Год"].apply(lambda x: x[: x.find("(") - 1])
df["Начислено дивидендов"] = df["Начислено дивидендов"].apply(
    lambda x: x[: x.find("/") - 1]
)
print(df)
