import pandas as pd


lithium_values = [
    ["Боливия", "21 млн тонн"],
    ["Аргентина", "19 млн тонн"],
    ["Чили", "11 млн тонн"],
    ["Австралия", "7,9 млн тонн"],
    ["США", "9,1 млн тонн"],
    ["Иран", "8,5 млн тонн"],
    ["Китай", "6,8 млн тонн"],
    ["Германия", "3,2 млн тонн"],
    ["Конго", "3 млн тонн"],
    ["Канада", "2,9 млн тонн"],
    ["Мексика", "1,7 млн тонн"],
    ["Бразилия", "0,47 млн тонн"],
    ["Чехия", "1,3 млн тонн"],
    ["Сербия", "1,2 млн тонн"],
    ["Россия", "1 млн тонн"],
    ["Перу", "0,88 млн тонн"],
    ["Зимбабве", "0,69 млн тонн"],
    ["Мали", "0,84 млн тонн"],
]
lithium_columns = ["Страна", "Разведанные запасы"]
lithium = pd.DataFrame(lithium_values, columns=lithium_columns)
lithium["Разведанные запасы, млн тонн"] = lithium["Разведанные запасы"].apply(
    lambda x: float(x.removesuffix("млн тонн").replace(",", "."))
)
lithium = lithium.drop(columns=["Разведанные запасы"]).sort_values(
    by=["Разведанные запасы, млн тонн"], ascending=False
).reset_index(drop=True)
print(lithium, end="\n\n")
lithium.info()
