import pandas as pd


pmi_manufacturing_eurozone_values = [
    ["03.07.2023 (июнь)", 43.4, 43.6, 44.8],
    ["01.06.2023 (май)", 44.8, 44.6, 45.8],
    ["02.05.2023 (апр)", 45.8, 45.5, 47.3],
    ["03.04.2023 (мар)", 47.3, 47.1, 48.5],
    ["01.03.2023 (фев)", 48.5, 48.5, 48.8],
    ["01.02.2023 (янв)", 48.8, 48.8, 47.8],
    ["02.01.2023 (дек)", 47.8, 47.8, 47.1],
    ["01.12.2022 (нояб)", 47.1, 47.3, 46.4],
    ["02.11.2022 (окт)", 46.4, 46.6, 48.4],
    ["03.10.2022 (сент)", 48.4, 48.5, 49.6],
    ["01.09.2022 (авг)", 49.6, 49.7, 49.7],
    ["01.08.2022 (июль)", 49.8, 49.6, 52.1],
    ["01.07.2022 (июнь)", 52.1, 52.0, 54.6],
    ["01.06.2022 (май)", 54.6, 54.4, 55.5],
    ["02.05.2022 (апр)", 55.5, 55.3, 56.5],
    ["01.04.2022 (мар)", 56.5, 57.0, 58.2],
    ["01.03.2022 (фев)", 58.2, 58.4, 58.7],
    ["01.02.2022 (янв)", 58.7, 59.0, 58.0],
    ["03.01.2022 (дек)", 58.0, 58.0, 58.4],
    ["01.12.2021 (нояб)", 58.4, 58.6, 58.6],
    ["02.11.2021 (окт)", 58.3, 58.5, 58.3],
    ["01.10.2021 (сент)", 58.6, 58.7, 61.4],
    ["01.09.2021 (авг)", 61.4, 61.5, 62.8],
    ["02.08.2021 (июль)", 62.8, 62.6, 63.4],
    ["01.07.2021 (июнь)", 63.4, 63.1, 63.1],
    ["01.06.2021 (май)", 63.1, 62.8, 62.8],
    ["03.05.2021 (апр)", 62.9, 63.3, 63.3],
    ["01.04.2021 (мар)", 62.5, 62.4, 57.9],
    ["01.03.2021 (фев)", 57.9, 57.7, 54.8],
    ["01.02.2021 (янв)", 54.8, 54.7, 54.7],
]
pmi_manufacturing_eurozone_columns = ["Дата выпуска", "Факт.", "Прогноз", "Пред."]
pmi_manufacturing_eurozone = pd.DataFrame(
    pmi_manufacturing_eurozone_values, columns=pmi_manufacturing_eurozone_columns
)
pmi_manufacturing_eurozone["Прогноз - Факт"] = (
    pmi_manufacturing_eurozone["Прогноз"] - pmi_manufacturing_eurozone["Факт."]
)
pmi_manufacturing_eurozone = pmi_manufacturing_eurozone[::-1]
pmi_manufacturing_eurozone.reset_index(drop=True, inplace=True)
print(pmi_manufacturing_eurozone)
