import pandas as pd


moex_volumes_values = [
    ["июль 2023", 3602.5, 6000, 27400, 65200, 53.5],
    ["июнь 2023", 3072.9, 6900, 23800, 61700, 29.0],
    ["май 2023", 3212.3, 5900, 21000, 62900, 25.5],
    ["апрель 2023", 3015.6, 5000, 21900, 59400, 40.2],
    ["март 2023", 3186.0, 5900, 24700, 70800, 21.2],
    ["февраль 2023", 2487.9, 4300, 19400, 56800, 12.9],
    ["январь 2023", 1599.7, 3500, 16900, 59300, 12.1],
    ["декабрь 2022", 4206.9, 4700, 21000, 63400, 19.0],
    ["ноябрь 2022", 3169.5, 3000, 14800, 52400, 13.6],
    ["октябрь 2022", 1953.6, 3600, 14900, 50100, 10.7],
    ["сентябрь 2022", 2506.4, 4700, 19500, 46900, 13.1],
    ["август 2022", 1872.1, 4900, 20900, 52900, 12.3],
    ["июль 2022", 1492.7, 6400, 17300, 50200, 10.1],
    ["июнь 2022", 1531.1, 5300, 17800, 48400, 8.7],
    ["май 2022", 995.4, 5600, 16100, 55400, 4.1],
    ["апрель 2022", 1446.0, 4200, 22000, 60400, 4.6],
    ["март 2022", 635.3, 2300, 41000, 110300, 6.4],
    ["февраль 2022", 5648.8, 16300, 34500, 40200, 12.3],
    ["январь 2022", 5002.6, 16700, 27000, 37800, 7.9],
]
moex_volumes_columns = [
    "месяц год",
    "Объем торгов на фондовом рынке, млрд руб.",
    "Срочный рынок, млрд руб.",
    "Объем торгов на валютном рынке, млрд руб.",
    "Объем торгов на денежном рынке, млрд руб.",
    "Объем торгов драгоценными металлами (спот и своп), млрд руб.",
]
moex_volumes = pd.DataFrame(moex_volumes_values, columns=moex_volumes_columns)
moex_volumes["Итого, млрд руб."] = moex_volumes.iloc[:, 1:].sum(axis=1)
print(moex_volumes[["месяц год", "Итого, млрд руб."]])
