import pandas as pd


rates_values = [
    ["Япония", -0.1, 3.3],
    ["Швейцария", 1.75, 1.6],
    ["Южная Корея", 3.5, 2.3],
    ["Сингапур", 3.51, 4.5],
    ["Китай", 3.55, 0.0],
    ["Австралия", 4.1, 6.0],
    ["еврозона", 4.25, 5.3],
    ["Канада", 5.0, 2.8],
    ["Великобритания", 5.25, 7.9],
    ["Соединенные Штаты", 5.5, 3.3],
    ["Индонезия", 5.75, 3.08],
    ["Саудовская Аравия", 6.0, 2.7],
    ["Индия", 6.5, 4.81],
    ["ЮАР", 8.25, 5.4],
    ["Россия", 8.5, 3.2],
    ["Мексика", 11.25, 5.06],
    ["Бразилия", 13.25, 3.16],
    ["Турция", 17.5, 47.83],
]
rates_columns = ["Страна", "Процентная ставка ЦБ", "Инфляция"]
rates = pd.DataFrame(rates_values, columns=rates_columns)
rates["Реальная ставка"] = rates["Процентная ставка ЦБ"] - rates["Инфляция"]
print(rates, end="\n\n")
max_value = rates["Реальная ставка"].max()
print(rates.query("`Реальная ставка` == @max_value"), end="\n\n")
min_value = rates["Реальная ставка"].min()
print(rates.query("`Реальная ставка` == @min_value"))
