import pandas as pd


data = {
    "Сотрудник": [
        "Екатерина Фролова",
        "Илья Дмитриевский",
        "Филипп Галин",
        "Михаил Волков",
        "Ирина Кузнецова",
        "Дмитрий Якубов",
        "Азамат Хайруллин",
    ],
    "Департамент": ["IT", "Маркетинг", "IT", "Маркетинг", "HR", "IT", "IT"],
    "Зарплата": [150000, 110000, 85000, 140000, 80000, 126000, 130000],
}

df = pd.DataFrame(data)
print(df.groupby("Департамент").agg({"Зарплата": "median", "Сотрудник": "count"}))
