import pandas as pd


data = {
    "Студент": [
        "Анна Крайнова",
        "Михаил Иванов",
        "Жанна Белова",
        "Борис Степанов",
        "Виктор Столяров",
        "Анна Егорова",
        "Никита Куликов",
    ],
    "Предмет": [
        "Математика",
        "Математика",
        "Физика",
        "Физика",
        "Математика",
        "История",
        "Математика",
    ],
    "Баллы": [85, 80, 78, 82, 88, 100, 91],
}

df = pd.DataFrame(data)
print(df[["Предмет", "Баллы"]].groupby("Предмет").agg(["min", "max", "mean"]))
