import pandas as pd


interest_rates_values = [
    ["Австралия", "Резервный банк Австралии", 4.1, "06.06.2023"],
    ["Бразилия", "Центральный банк Бразилии", 13.75, "04.08.2022"],
    ["Великобритания", "Банк Англии", 5.0, "22.06.2023"],
    ["Дания", "Национальный банк Дании", 3.25, "15.06.2023"],
    ["Еврозона", "Европейский центральный банк", 4.0, "15.06.2023"],
    ["Индия", "Резервный банк Индии", 6.5, "08.02.2023"],
    ["Канада", "Банк Канады", 5.0, "12.07.2023"],
    ["Китай", "Народный банк Китая", 3.55, "20.06.2023"],
    ["Мексика", "Банк Мексики", 11.25, "30.03.2023"],
    ["Новая Зеландия", "Резервный банк Новой Зеландии", 5.5, "24.05.2023"],
    ["Россия", "Центральный банк Российской Федерации", 8.5, "24.07.2023"],
    ["США", "Федеральная резервная система", 5.25, "04.05.2023"],
    ["Турция", "Центральный банк Турции", 17.5, "20.07.2023"],
    ["Швейцария", "Национальный банк Швейцарии", 1.75, "22.06.2023"],
    ["Швеция", "Банк Швеции", 3.75, "30.06.2023"],
    ["ЮАР", "Южно-Африканский резервный банк", 8.25, "25.05.2023"],
    ["Япония", "Банк Японии", -0.1, "03.08.2016"],
]
interest_rates_columns = ["Страна", "Банк", "Ставка", "Дата вступления в силу"]
interest_rates = pd.DataFrame(interest_rates_values, columns=interest_rates_columns)
interest_rates.query("Ставка > 8", inplace=True)
interest_rates.reset_index(inplace=True, drop=True)
interest_rates.drop("Банк", axis=1, inplace=True)
print(interest_rates)
